irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_flash_2819_IUT.c
  uint32_t tmpreg = 0;


  ((void)0);


  tmpreg = ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->ACR;


  tmpreg &= ((uint32_t)0x00000038);
  tmpreg |= FLASH_Latency;


  ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->ACR = tmpreg;

CS_CMM_PROBE_NODE_STMT(70,7,1) 
 CODESCROLL_FUNC_END(126, 11, 269) } CODESCROLL_FUNC_END_RBRACE 
/* # 280 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
void FLASH_HalfCycleAccessCmd(uint32_t FLASH_HalfCycleAccess)
{ CODESCROLL_FUNC_BEGIN(127, (127, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable335,326) 

  
  CS_CMM_PROBE_NODE_STMT(70,6,0) ((void)0);


  ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->ACR &= ((uint32_t)0xFFFFFFF7);
  ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->ACR |= FLASH_HalfCycleAccess;

CS_CMM_PROBE_NODE_STMT(70,5,1) 
 CODESCROLL_FUNC_END(127, 11, 288) } CODESCROLL_FUNC_END_RBRACE 
/* # 299 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
void FLASH_PrefetchBufferCmd(uint32_t FLASH_PrefetchBuffer)
{ CODESCROLL_FUNC_BEGIN(128, (128, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable336,327) 

  
  CS_CMM_PROBE_NODE_STMT(70,4,0) ((void)0);


  ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->ACR &= ((uint32_t)0xFFFFFFEF);
  ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->ACR |= FLASH_PrefetchBuffer;

CS_CMM_PROBE_NODE_STMT(70,3,1) 
 CODESCROLL_FUNC_END(128, 11, 307) } CODESCROLL_FUNC_END_RBRACE 
/* # 318 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
void FLASH_Unlock(void)
{ CODESCROLL_FUNC_BEGIN(129, (129, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable337,328) 

  
  CS_CMM_PROBE_NODE_STMT(70,2,0) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->KEYR = ((uint32_t)0x45670123);
  ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->KEYR = ((uint32_t)0xCDEF89AB);







CS_CMM_PROBE_NODE_STMT(70,1,1) 
 CODESCROLL_FUNC_END(129, 11, 329) } CODESCROLL_FUNC_END_RBRACE 
/* # 339 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
void FLASH_UnlockBank1(void)
{ CODESCROLL_FUNC_BEGIN(130, (130, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable338,329) 

  
  CS_CMM_PROBE_NODE_STMT(70,0,0) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->KEYR = ((uint32_t)0x45670123);
  ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->KEYR = ((uint32_t)0xCDEF89AB);

CS_CMM_PROBE_NODE_STMT(71,7,1) 
 CODESCROLL_FUNC_END(130, 11, 344) } CODESCROLL_FUNC_END_RBRACE 
/* # 371 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
void FLASH_Lock(void)
{ CODESCROLL_FUNC_BEGIN(131, (131, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable339,330) 

  
  CS_CMM_PROBE_NODE_STMT(71,6,0) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR |= ((uint32_t)0x00000080);






CS_CMM_PROBE_NODE_STMT(71,5,1) 
 CODESCROLL_FUNC_END(131, 11, 380) } CODESCROLL_FUNC_END_RBRACE 
/* # 391 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
void FLASH_LockBank1(void)
{ CODESCROLL_FUNC_BEGIN(132, (132, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable340,331) 

  
  CS_CMM_PROBE_NODE_STMT(71,4,0) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR |= ((uint32_t)0x00000080);

CS_CMM_PROBE_NODE_STMT(71,3,1) 
 CODESCROLL_FUNC_END(132, 11, 395) } CODESCROLL_FUNC_END_RBRACE 
/* # 418 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
FLASH_Status FLASH_ErasePage(uint32_t Page_Address)
{ CODESCROLL_FUNC_BEGIN(133, (133, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable341,332) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable342,71,2,0)

  FLASH_Status status = FLASH_COMPLETE;

  ((void)0);
/* # 467 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
  status = FLASH_WaitForLastOperation(((uint32_t)0x000B0000));

  
  CS_CMM_PROBE_NODE_STMT(71,1,1) if(status == FLASH_COMPLETE)
  {

    
    CS_CMM_PROBE_NODE_STMT(71,0,2) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR|= ((uint32_t)0x00000002);
    ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->AR = Page_Address;
    ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR|= ((uint32_t)0x00000040);


    status = FLASH_WaitForLastOperation(((uint32_t)0x000B0000));
    
    CS_CMM_PROBE_NODE_STMT(72,7,3) if(status != FLASH_TIMEOUT)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable343,333) 

      
      CS_CMM_PROBE_NODE_STMT(72,6,4) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR &= ((uint32_t)0x00001FFD);
    } CS_CMM_ELSE_PROBE_C1(334) 
  } CS_CMM_ELSE_PROBE_C1(335) 



  
  CS_CMM_PROBE_NODE_STMT(72,5,5) 
   CODESCROLL_FUNC_END(133, 11, 487) return status;
} CODESCROLL_FUNC_END_RBRACE 
/* # 497 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
FLASH_Status FLASH_EraseAllPages(void)
{ CODESCROLL_FUNC_BEGIN(134, (134, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable344,336) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable345,72,4,0)

