irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_flash_2819_IUT.c
  FLASH_Status status = FLASH_COMPLETE;
/* # 535 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
  status = FLASH_WaitForLastOperation(((uint32_t)0x000B0000));
  
  CS_CMM_PROBE_NODE_STMT(72,3,1) if(status == FLASH_COMPLETE)
  {

     
     CS_CMM_PROBE_NODE_STMT(72,2,2) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR |= ((uint32_t)0x00000004);
     ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR |= ((uint32_t)0x00000040);


    status = FLASH_WaitForLastOperation(((uint32_t)0x000B0000));
    
    CS_CMM_PROBE_NODE_STMT(72,1,3) if(status != FLASH_TIMEOUT)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable346,337) 

      
      CS_CMM_PROBE_NODE_STMT(72,0,4) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR &= ((uint32_t)0x00001FFB);
    } CS_CMM_ELSE_PROBE_C1(338) 
  } CS_CMM_ELSE_PROBE_C1(339) 



  
  CS_CMM_PROBE_NODE_STMT(73,7,5) 
   CODESCROLL_FUNC_END(134, 11, 553) return status;
} CODESCROLL_FUNC_END_RBRACE 
/* # 566 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
FLASH_Status FLASH_EraseAllBank1Pages(void)
{ CODESCROLL_FUNC_BEGIN(135, (135, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable347,340) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable348,73,6,0)

  FLASH_Status status = FLASH_COMPLETE;

  status = FLASH_WaitForLastBank1Operation(((uint32_t)0x000B0000));

  
  CS_CMM_PROBE_NODE_STMT(73,5,1) if(status == FLASH_COMPLETE)
  {

     
     CS_CMM_PROBE_NODE_STMT(73,4,2) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR |= ((uint32_t)0x00000004);
     ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR |= ((uint32_t)0x00000040);


    status = FLASH_WaitForLastBank1Operation(((uint32_t)0x000B0000));
    
    CS_CMM_PROBE_NODE_STMT(73,3,3) if(status != FLASH_TIMEOUT)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable349,341) 

      
      CS_CMM_PROBE_NODE_STMT(73,2,4) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR &= ((uint32_t)0x00001FFB);
    } CS_CMM_ELSE_PROBE_C1(342) 
  } CS_CMM_ELSE_PROBE_C1(343) 

  
  CS_CMM_PROBE_NODE_STMT(73,1,5) 
   CODESCROLL_FUNC_END(135, 11, 587) return status;
} CODESCROLL_FUNC_END_RBRACE 
/* # 631 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
FLASH_Status FLASH_EraseOptionBytes(void)
{ CODESCROLL_FUNC_BEGIN(136, (136, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable350,344) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable351,73,0,0)

  uint16_t rdptmp = ((uint16_t)0x00A5);

  FLASH_Status status = FLASH_COMPLETE;


  
  CS_CMM_PROBE_NODE_STMT(74,7,1) if(FLASH_GetReadOutProtectionStatus() != RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable352,345) 
    
    CS_CMM_PROBE_NODE_STMT(74,6,2) rdptmp = 0x00;
  } CS_CMM_ELSE_PROBE_C1(346) 


  
  CS_CMM_PROBE_NODE_STMT(74,5,3) status = FLASH_WaitForLastOperation(((uint32_t)0x000B0000));
  
  CS_CMM_PROBE_NODE_STMT(74,4,4) if(status == FLASH_COMPLETE)
  {

    
    CS_CMM_PROBE_NODE_STMT(74,3,5) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->OPTKEYR = ((uint32_t)0x45670123);
    ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->OPTKEYR = ((uint32_t)0xCDEF89AB);


    ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR |= ((uint32_t)0x00000020);
    ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR |= ((uint32_t)0x00000040);

    status = FLASH_WaitForLastOperation(((uint32_t)0x000B0000));

    
    CS_CMM_PROBE_NODE_STMT(74,2,6) if(status == FLASH_COMPLETE)
    {

      
      CS_CMM_PROBE_NODE_STMT(74,1,7) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR &= ((uint32_t)0x00001FDF);


      ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR |= ((uint32_t)0x00000010);

      ((OB_TypeDef *) ((uint32_t)0x1FFFF800))->RDP = (uint16_t)rdptmp;

      status = FLASH_WaitForLastOperation(((uint32_t)0x00002000));

      
      CS_CMM_PROBE_NODE_STMT(74,0,8) if(status != FLASH_TIMEOUT)
      { CS_CMM_PROBE_DECL_C1(CodeScrollVariable353,347) 

        
        CS_CMM_PROBE_NODE_STMT(75,7,9) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR &= ((uint32_t)0x00001FEF);
      } CS_CMM_ELSE_PROBE_C1(348) 
    }
    else
    {
      
      CS_CMM_PROBE_NODE_STMT(75,6,10) if (status != FLASH_TIMEOUT)
      { CS_CMM_PROBE_DECL_C1(CodeScrollVariable354,349) 

        
        CS_CMM_PROBE_NODE_STMT(75,5,11) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR &= ((uint32_t)0x00001FEF);
      } CS_CMM_ELSE_PROBE_C1(350) 
    }
  } CS_CMM_ELSE_PROBE_C1(351) 

  
  CS_CMM_PROBE_NODE_STMT(75,4,12) 
   CODESCROLL_FUNC_END(136, 11, 685) return status;
} CODESCROLL_FUNC_END_RBRACE 
/* # 696 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
FLASH_Status FLASH_ProgramWord(uint32_t Address, uint32_t Data)
{ CODESCROLL_FUNC_BEGIN(137, (137, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable355,352) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable356,75,3,0)

  FLASH_Status status = FLASH_COMPLETE;
  volatile uint32_t tmp = 0;


  ((void)0);
/* # 851 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
  status = FLASH_WaitForLastOperation(((uint32_t)0x00002000));

  
  CS_CMM_PROBE_NODE_STMT(75,2,1) if(status == FLASH_COMPLETE)
  {


    
    CS_CMM_PROBE_NODE_STMT(75,1,2) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR |= ((uint32_t)0x00000001);

    *(volatile uint16_t*)Address = (uint16_t)Data;

    status = FLASH_WaitForLastOperation(((uint32_t)0x00002000));

    
    CS_CMM_PROBE_NODE_STMT(75,0,3) if(status == FLASH_COMPLETE)
    {


      
