irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_flash_2819_IUT.c
      CS_CMM_PROBE_NODE_STMT(76,7,4) tmp = Address + 2;

      *(volatile uint16_t*) tmp = Data >> 16;


      status = FLASH_WaitForLastOperation(((uint32_t)0x00002000));

      
      CS_CMM_PROBE_NODE_STMT(76,6,5) if(status != FLASH_TIMEOUT)
      { CS_CMM_PROBE_DECL_C1(CodeScrollVariable357,353) 

        
        CS_CMM_PROBE_NODE_STMT(76,5,6) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR &= ((uint32_t)0x00001FFE);
      } CS_CMM_ELSE_PROBE_C1(354) 
    }
    else
    {
      
      CS_CMM_PROBE_NODE_STMT(76,4,7) if (status != FLASH_TIMEOUT)
      { CS_CMM_PROBE_DECL_C1(CodeScrollVariable358,355) 

        
        CS_CMM_PROBE_NODE_STMT(76,3,8) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR &= ((uint32_t)0x00001FFE);
      } CS_CMM_ELSE_PROBE_C1(356) 
    }
  } CS_CMM_ELSE_PROBE_C1(357) 



  
  CS_CMM_PROBE_NODE_STMT(76,2,9) 
   CODESCROLL_FUNC_END(137, 11, 892) return status;
} CODESCROLL_FUNC_END_RBRACE 
/* # 903 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
FLASH_Status FLASH_ProgramHalfWord(uint32_t Address, uint16_t Data)
{ CODESCROLL_FUNC_BEGIN(138, (138, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable359,358) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable360,76,1,0)

  FLASH_Status status = FLASH_COMPLETE;

  ((void)0);
/* # 949 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
  status = FLASH_WaitForLastOperation(((uint32_t)0x00002000));

  
  CS_CMM_PROBE_NODE_STMT(76,0,1) if(status == FLASH_COMPLETE)
  {

    
    CS_CMM_PROBE_NODE_STMT(77,7,2) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR |= ((uint32_t)0x00000001);

    *(volatile uint16_t*)Address = Data;

    status = FLASH_WaitForLastOperation(((uint32_t)0x00002000));
    
    CS_CMM_PROBE_NODE_STMT(77,6,3) if(status != FLASH_TIMEOUT)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable361,359) 

      
      CS_CMM_PROBE_NODE_STMT(77,5,4) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR &= ((uint32_t)0x00001FFE);
    } CS_CMM_ELSE_PROBE_C1(360) 
  } CS_CMM_ELSE_PROBE_C1(361) 



  
  CS_CMM_PROBE_NODE_STMT(77,4,5) 
   CODESCROLL_FUNC_END(138, 11, 968) return status;
} CODESCROLL_FUNC_END_RBRACE 
/* # 980 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
FLASH_Status FLASH_ProgramOptionByteData(uint32_t Address, uint8_t Data)
{ CODESCROLL_FUNC_BEGIN(139, (139, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable362,362) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable363,77,3,0)

  FLASH_Status status = FLASH_COMPLETE;

  ((void)0);
  status = FLASH_WaitForLastOperation(((uint32_t)0x00002000));

  
  CS_CMM_PROBE_NODE_STMT(77,2,1) if(status == FLASH_COMPLETE)
  {

    
    CS_CMM_PROBE_NODE_STMT(77,1,2) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->OPTKEYR = ((uint32_t)0x45670123);
    ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->OPTKEYR = ((uint32_t)0xCDEF89AB);

    ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR |= ((uint32_t)0x00000010);
    *(volatile uint16_t*)Address = Data;


    status = FLASH_WaitForLastOperation(((uint32_t)0x00002000));
    
    CS_CMM_PROBE_NODE_STMT(77,0,3) if(status != FLASH_TIMEOUT)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable364,363) 

      
      CS_CMM_PROBE_NODE_STMT(78,7,4) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR &= ((uint32_t)0x00001FEF);
    } CS_CMM_ELSE_PROBE_C1(364) 
  } CS_CMM_ELSE_PROBE_C1(365) 

  
  CS_CMM_PROBE_NODE_STMT(78,6,5) 
   CODESCROLL_FUNC_END(139, 11, 1005) return status;
} CODESCROLL_FUNC_END_RBRACE 
/* # 1026 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
FLASH_Status FLASH_EnableWriteProtection(uint32_t FLASH_Pages)
{ CODESCROLL_FUNC_BEGIN(140, (140, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable365,366) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable366,78,5,0)

  uint16_t WRP0_Data = 0xFFFF, WRP1_Data = 0xFFFF, WRP2_Data = 0xFFFF, WRP3_Data = 0xFFFF;

  FLASH_Status status = FLASH_COMPLETE;


  ((void)0);

  FLASH_Pages = (uint32_t)(~FLASH_Pages);
  WRP0_Data = (uint16_t)(FLASH_Pages & ((uint32_t)0x000000FF));
  WRP1_Data = (uint16_t)((FLASH_Pages & ((uint32_t)0x0000FF00)) >> 8);
  WRP2_Data = (uint16_t)((FLASH_Pages & ((uint32_t)0x00FF0000)) >> 16);
  WRP3_Data = (uint16_t)((FLASH_Pages & ((uint32_t)0xFF000000)) >> 24);


  status = FLASH_WaitForLastOperation(((uint32_t)0x00002000));

  
  CS_CMM_PROBE_NODE_STMT(78,4,1) if(status == FLASH_COMPLETE)
  {

    
    CS_CMM_PROBE_NODE_STMT(78,3,2) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->OPTKEYR = ((uint32_t)0x45670123);
    ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->OPTKEYR = ((uint32_t)0xCDEF89AB);
    ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR |= ((uint32_t)0x00000010);
    
    CS_CMM_PROBE_NODE_STMT(78,2,3) if(WRP0_Data != 0xFF)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable367,367) 
      
      CS_CMM_PROBE_NODE_STMT(78,1,4) ((OB_TypeDef *) ((uint32_t)0x1FFFF800))->WRP0 = WRP0_Data;


      status = FLASH_WaitForLastOperation(((uint32_t)0x00002000));
    } CS_CMM_ELSE_PROBE_C1(368) 
    
    CS_CMM_PROBE_NODE_STMT(78,0,5) if(CS_MCDC_140_2((status == FLASH_COMPLETE), (WRP1_Data != 0xFF), 18))
    { CS_CMM_PROBE_DECL_CX(CodeScrollVariable368,12) 
      
      CS_CMM_PROBE_NODE_STMT(79,7,6) ((OB_TypeDef *) ((uint32_t)0x1FFFF800))->WRP1 = WRP1_Data;


      status = FLASH_WaitForLastOperation(((uint32_t)0x00002000));
    } CS_CMM_ELSE_PROBE_CX(13) 
    
    CS_CMM_PROBE_NODE_STMT(79,6,7) if(CS_MCDC_140_3((status == FLASH_COMPLETE), (WRP2_Data != 0xFF), 21))
    { CS_CMM_PROBE_DECL_CX(CodeScrollVariable369,14) 
      
      CS_CMM_PROBE_NODE_STMT(79,5,8) ((OB_TypeDef *) ((uint32_t)0x1FFFF800))->WRP2 = WRP2_Data;


      status = FLASH_WaitForLastOperation(((uint32_t)0x00002000));
    } CS_CMM_ELSE_PROBE_CX(15) 

    
    CS_CMM_PROBE_NODE_STMT(79,4,9) if(CS_MCDC_140_4((status == FLASH_COMPLETE), (WRP3_Data != 0xFF), 24))
    { CS_CMM_PROBE_DECL_CX(CodeScrollVariable370,16) 
      
      CS_CMM_PROBE_NODE_STMT(79,3,10) ((OB_TypeDef *) ((uint32_t)0x1FFFF800))->WRP3 = WRP3_Data;


      status = FLASH_WaitForLastOperation(((uint32_t)0x00002000));
    } CS_CMM_ELSE_PROBE_CX(17) 

    
