irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_flash_2819_IUT.c
    CS_CMM_PROBE_NODE_STMT(79,2,11) if(status != FLASH_TIMEOUT)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable371,369) 

      
      CS_CMM_PROBE_NODE_STMT(79,1,12) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR &= ((uint32_t)0x00001FEF);
    } CS_CMM_ELSE_PROBE_C1(370) 
  } CS_CMM_ELSE_PROBE_C1(371) 

  
  CS_CMM_PROBE_NODE_STMT(79,0,13) 
   CODESCROLL_FUNC_END(140, 11, 1087) return status;
} CODESCROLL_FUNC_END_RBRACE 
/* # 1100 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
FLASH_Status FLASH_ReadOutProtection(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(141, (141, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable372,372) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable373,80,7,0)

  FLASH_Status status = FLASH_COMPLETE;

  ((void)0);
  status = FLASH_WaitForLastOperation(((uint32_t)0x000B0000));
  
  CS_CMM_PROBE_NODE_STMT(80,6,1) if(status == FLASH_COMPLETE)
  {

    
    CS_CMM_PROBE_NODE_STMT(80,5,2) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->OPTKEYR = ((uint32_t)0x45670123);
    ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->OPTKEYR = ((uint32_t)0xCDEF89AB);
    ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR |= ((uint32_t)0x00000020);
    ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR |= ((uint32_t)0x00000040);

    status = FLASH_WaitForLastOperation(((uint32_t)0x000B0000));
    
    CS_CMM_PROBE_NODE_STMT(80,4,3) if(status == FLASH_COMPLETE)
    {

      
      CS_CMM_PROBE_NODE_STMT(80,3,4) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR &= ((uint32_t)0x00001FDF);

      ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR |= ((uint32_t)0x00000010);
      
      CS_CMM_PROBE_NODE_STMT(80,2,5) if(NewState != DISABLE)
      { CS_CMM_PROBE_DECL_C1(CodeScrollVariable374,373) 
        
        CS_CMM_PROBE_NODE_STMT(80,1,6) ((OB_TypeDef *) ((uint32_t)0x1FFFF800))->RDP = 0x00;
      }
      else
      { CS_CMM_PROBE_DECL_C1(CodeScrollVariable375,374) 
        
        CS_CMM_PROBE_NODE_STMT(80,0,7) ((OB_TypeDef *) ((uint32_t)0x1FFFF800))->RDP = ((uint16_t)0x00A5);
      }

      
      CS_CMM_PROBE_NODE_STMT(81,7,8) status = FLASH_WaitForLastOperation(((uint32_t)0x000B0000));

      
      CS_CMM_PROBE_NODE_STMT(81,6,9) if(status != FLASH_TIMEOUT)
      { CS_CMM_PROBE_DECL_C1(CodeScrollVariable376,375) 

        
        CS_CMM_PROBE_NODE_STMT(81,5,10) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR &= ((uint32_t)0x00001FEF);
      } CS_CMM_ELSE_PROBE_C1(376) 
    }
    else
    {
      
      CS_CMM_PROBE_NODE_STMT(81,4,11) if(status != FLASH_TIMEOUT)
      { CS_CMM_PROBE_DECL_C1(CodeScrollVariable377,377) 

        
        CS_CMM_PROBE_NODE_STMT(81,3,12) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR &= ((uint32_t)0x00001FDF);
      } CS_CMM_ELSE_PROBE_C1(378) 
    }
  } CS_CMM_ELSE_PROBE_C1(379) 

  
  CS_CMM_PROBE_NODE_STMT(81,2,13) 
   CODESCROLL_FUNC_END(141, 11, 1148) return status;
} CODESCROLL_FUNC_END_RBRACE 
/* # 1169 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
FLASH_Status FLASH_UserOptionByteConfig(uint16_t OB_IWDG, uint16_t OB_STOP, uint16_t OB_STDBY)
{ CODESCROLL_FUNC_BEGIN(142, (142, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable378,380) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable379,81,1,0)

  FLASH_Status status = FLASH_COMPLETE;


  ((void)0);
  ((void)0);
  ((void)0);


  ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->OPTKEYR = ((uint32_t)0x45670123);
  ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->OPTKEYR = ((uint32_t)0xCDEF89AB);


  status = FLASH_WaitForLastOperation(((uint32_t)0x00002000));

  
  CS_CMM_PROBE_NODE_STMT(81,0,1) if(status == FLASH_COMPLETE)
  {

    
    CS_CMM_PROBE_NODE_STMT(82,7,2) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR |= ((uint32_t)0x00000010);

    ((OB_TypeDef *) ((uint32_t)0x1FFFF800))->USER = OB_IWDG | (uint16_t)(OB_STOP | (uint16_t)(OB_STDBY | ((uint16_t)0xF8)));


    status = FLASH_WaitForLastOperation(((uint32_t)0x00002000));
    
    CS_CMM_PROBE_NODE_STMT(82,6,3) if(status != FLASH_TIMEOUT)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable380,381) 

      
      CS_CMM_PROBE_NODE_STMT(82,5,4) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR &= ((uint32_t)0x00001FEF);
    } CS_CMM_ELSE_PROBE_C1(382) 
  } CS_CMM_ELSE_PROBE_C1(383) 

  
  CS_CMM_PROBE_NODE_STMT(82,4,5) 
   CODESCROLL_FUNC_END(142, 11, 1201) return status;
} CODESCROLL_FUNC_END_RBRACE 
/* # 1267 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
uint32_t FLASH_GetUserOptionByte(void)
{ CODESCROLL_FUNC_BEGIN(143, (143, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable381,384) 

  
  CS_CMM_PROBE_NODE_STMT(82,3,0) 
  CS_CMM_PROBE_NODE_STMT(82,2,1) 
   CODESCROLL_FUNC_END(143, 11, 1270) return (uint32_t)(((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->OBR >> 2);
} CODESCROLL_FUNC_END_RBRACE 







uint32_t FLASH_GetWriteProtectionOptionByte(void)
{ CODESCROLL_FUNC_BEGIN(144, (144, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable382,385) 

  
  CS_CMM_PROBE_NODE_STMT(82,1,0) 
  CS_CMM_PROBE_NODE_STMT(82,0,1) 
   CODESCROLL_FUNC_END(144, 11, 1282) return (uint32_t)(((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->WRPR);
} CODESCROLL_FUNC_END_RBRACE 







FlagStatus FLASH_GetReadOutProtectionStatus(void)
{ CODESCROLL_FUNC_BEGIN(145, (145, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable383,386) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable384,83,7,0)

  FlagStatus readoutstatus = RESET;
  
  CS_CMM_PROBE_NODE_STMT(83,6,1) if ((((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->OBR & ((uint32_t)0x00000002)) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable385,387) 
    
