irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_flash_2819_IUT.c
    CS_CMM_PROBE_NODE_STMT(83,5,2) readoutstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable386,388) 
    
    CS_CMM_PROBE_NODE_STMT(83,4,3) readoutstatus = RESET;
  }
  
  CS_CMM_PROBE_NODE_STMT(83,3,4) 
   CODESCROLL_FUNC_END(145, 11, 1302) return readoutstatus;
} CODESCROLL_FUNC_END_RBRACE 







FlagStatus FLASH_GetPrefetchBufferStatus(void)
{ CODESCROLL_FUNC_BEGIN(146, (146, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable387,389) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable388,83,2,0)

  FlagStatus bitstatus = RESET;

  
  CS_CMM_PROBE_NODE_STMT(83,1,1) if ((((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->ACR & ((uint32_t)0x00000020)) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable389,390) 
    
    CS_CMM_PROBE_NODE_STMT(83,0,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable390,391) 
    
    CS_CMM_PROBE_NODE_STMT(84,7,3) bitstatus = RESET;
  }

  
  CS_CMM_PROBE_NODE_STMT(84,6,4) 
   CODESCROLL_FUNC_END(146, 11, 1324) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 1341 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
void FLASH_ITConfig(uint32_t FLASH_IT, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(147, (147, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable391,392) 
/* # 1376 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
  
  CS_CMM_PROBE_NODE_STMT(84,5,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(84,4,1) if(NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable392,393) 

    
    CS_CMM_PROBE_NODE_STMT(84,3,2) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR |= FLASH_IT;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable393,394) 

    
    CS_CMM_PROBE_NODE_STMT(84,2,3) ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->CR &= ~(uint32_t)FLASH_IT;
  }


CS_CMM_PROBE_NODE_STMT(84,1,4) 
 CODESCROLL_FUNC_END(147, 11, 1390) } CODESCROLL_FUNC_END_RBRACE 
/* # 1408 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
FlagStatus FLASH_GetFlagStatus(uint32_t FLASH_FLAG)
{ CODESCROLL_FUNC_BEGIN(148, (148, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable394,395) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable395,84,0,0)

  FlagStatus bitstatus = RESET;
/* # 1453 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
  ((void)0) ;
  
  CS_CMM_PROBE_NODE_STMT(85,7,1) if(FLASH_FLAG == ((uint32_t)0x00000001))
  {
    
    CS_CMM_PROBE_NODE_STMT(85,6,2) if((((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->OBR & ((uint32_t)0x00000001)) != (uint32_t)RESET)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable396,396) 
      
      CS_CMM_PROBE_NODE_STMT(85,5,3) bitstatus = SET;
    }
    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable397,397) 
      
      CS_CMM_PROBE_NODE_STMT(85,4,4) bitstatus = RESET;
    }
  }
  else
  {
   
   CS_CMM_PROBE_NODE_STMT(85,3,5) if((((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->SR & FLASH_FLAG) != (uint32_t)RESET)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable398,398) 
      
      CS_CMM_PROBE_NODE_STMT(85,2,6) bitstatus = SET;
    }
    else
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable399,399) 
      
      CS_CMM_PROBE_NODE_STMT(85,1,7) bitstatus = RESET;
    }
  }



  
  CS_CMM_PROBE_NODE_STMT(85,0,8) 
   CODESCROLL_FUNC_END(148, 11, 1479) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 1494 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
void FLASH_ClearFlag(uint32_t FLASH_FLAG)
{ CODESCROLL_FUNC_BEGIN(149, (149, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable400,400) 
/* # 1513 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
  
  CS_CMM_PROBE_NODE_STMT(86,7,0) ((void)0) ;


  ((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->SR = FLASH_FLAG;


CS_CMM_PROBE_NODE_STMT(86,6,1) 
 CODESCROLL_FUNC_END(149, 11, 1518) } CODESCROLL_FUNC_END_RBRACE 
/* # 1528 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
FLASH_Status FLASH_GetStatus(void)
{ CODESCROLL_FUNC_BEGIN(150, (150, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable401,401) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable402,86,5,0)

  FLASH_Status flashstatus = FLASH_COMPLETE;

  
  CS_CMM_PROBE_NODE_STMT(86,4,1) if((((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->SR & ((uint32_t)0x00000001)) == ((uint32_t)0x00000001))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable403,402) 
    
    CS_CMM_PROBE_NODE_STMT(86,3,2) flashstatus = FLASH_BUSY;
  }
  else
  {
    
    CS_CMM_PROBE_NODE_STMT(86,2,3) if((((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->SR & ((uint32_t)0x00000004)) != 0)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable404,403) 
      
      CS_CMM_PROBE_NODE_STMT(86,1,4) flashstatus = FLASH_ERROR_PG;
    }
    else
    {
      
      CS_CMM_PROBE_NODE_STMT(86,0,5) if((((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->SR & ((uint32_t)0x00000010)) != 0 )
      { CS_CMM_PROBE_DECL_C1(CodeScrollVariable405,404) 
        
        CS_CMM_PROBE_NODE_STMT(87,7,6) flashstatus = FLASH_ERROR_WRP;
      }
      else
      { CS_CMM_PROBE_DECL_C1(CodeScrollVariable406,405) 
        
        CS_CMM_PROBE_NODE_STMT(87,6,7) flashstatus = FLASH_COMPLETE;
      }
    }
  }

  
