irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_flash_2819_IUT.c
  CS_CMM_PROBE_NODE_STMT(87,5,8) 
   CODESCROLL_FUNC_END(150, 11, 1555) return flashstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 1566 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
FLASH_Status FLASH_GetBank1Status(void)
{ CODESCROLL_FUNC_BEGIN(151, (151, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable407,406) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable408,87,4,0)

  FLASH_Status flashstatus = FLASH_COMPLETE;

  
  CS_CMM_PROBE_NODE_STMT(87,3,1) if((((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->SR & ((uint32_t)0x00000001)) == ((uint32_t)0x00000001))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable409,407) 
    
    CS_CMM_PROBE_NODE_STMT(87,2,2) flashstatus = FLASH_BUSY;
  }
  else
  {
    
    CS_CMM_PROBE_NODE_STMT(87,1,3) if((((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->SR & ((uint32_t)0x00000004)) != 0)
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable410,408) 
      
      CS_CMM_PROBE_NODE_STMT(87,0,4) flashstatus = FLASH_ERROR_PG;
    }
    else
    {
      
      CS_CMM_PROBE_NODE_STMT(88,7,5) if((((FLASH_TypeDef *) ((((uint32_t)0x40000000) + 0x20000) + 0x2000))->SR & ((uint32_t)0x00000010)) != 0 )
      { CS_CMM_PROBE_DECL_C1(CodeScrollVariable411,409) 
        
        CS_CMM_PROBE_NODE_STMT(88,6,6) flashstatus = FLASH_ERROR_WRP;
      }
      else
      { CS_CMM_PROBE_DECL_C1(CodeScrollVariable412,410) 
        
        CS_CMM_PROBE_NODE_STMT(88,5,7) flashstatus = FLASH_COMPLETE;
      }
    }
  }

  
  CS_CMM_PROBE_NODE_STMT(88,4,8) 
   CODESCROLL_FUNC_END(151, 11, 1593) return flashstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 1646 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
FLASH_Status FLASH_WaitForLastOperation(uint32_t Timeout)
{ CODESCROLL_FUNC_BEGIN(152, (152, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable413,411) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable414,88,3,0)

  FLASH_Status status = FLASH_COMPLETE;


  status = FLASH_GetBank1Status();

  while( CS_CMM_PROBE_NODE_EXPR(88,2,1) CS_MCDC_152_0((status == FLASH_BUSY), (Timeout != 0x00), 27))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable415,18) 
    
    CS_CMM_PROBE_NODE_STMT(88,1,2) status = FLASH_GetBank1Status();
    Timeout--;
  } CS_CMM_PROBE_CX(19) CS_CMM_LABEL(cs_cmm_while_end_152_1) 
  
  CS_CMM_PROBE_NODE_STMT(88,0,3) if(Timeout == 0x00 )
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable416,412) 
    
    CS_CMM_PROBE_NODE_STMT(89,7,4) status = FLASH_TIMEOUT;
  } CS_CMM_ELSE_PROBE_C1(413) 

  
  CS_CMM_PROBE_NODE_STMT(89,6,5) 
   CODESCROLL_FUNC_END(152, 11, 1663) return status;
} CODESCROLL_FUNC_END_RBRACE 
/* # 1674 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_flash.c"*/
FLASH_Status FLASH_WaitForLastBank1Operation(uint32_t Timeout)
{ CODESCROLL_FUNC_BEGIN(153, (153, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable417,414) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable418,89,5,0)

  FLASH_Status status = FLASH_COMPLETE;


  status = FLASH_GetBank1Status();

  while( CS_CMM_PROBE_NODE_EXPR(89,4,1) CS_MCDC_153_0((status == ((uint32_t)0x00000001)), (Timeout != 0x00), 30))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable419,20) 
    
    CS_CMM_PROBE_NODE_STMT(89,3,2) status = FLASH_GetBank1Status();
    Timeout--;
  } CS_CMM_PROBE_CX(21) CS_CMM_LABEL(cs_cmm_while_end_153_1) 
  
  CS_CMM_PROBE_NODE_STMT(89,2,3) if(Timeout == 0x00 )
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable420,415) 
    
    CS_CMM_PROBE_NODE_STMT(89,1,4) status = FLASH_TIMEOUT;
  } CS_CMM_ELSE_PROBE_C1(416) 

  
  CS_CMM_PROBE_NODE_STMT(89,0,5) 
   CODESCROLL_FUNC_END(153, 11, 1691) return status;
} CODESCROLL_FUNC_END_RBRACE 
